{
  "nav": {
    "ourStory": "Náš Příběh",
    "location": "Místo & Doprava",
    "rsvp": "Potvrdit Účast"
  },
  "home": {
    "names": "Ștefan & Kristýna",
    "title": "Ștefan & Kristýna",
    "subtitle": "\"Řekneme si ANO\"",
    "date": "11. července 2026",
    "countdown": "{days} dní, {hours} hodin, {minutes} minut a {seconds} sekund do našeho velkého dne!",
    "venue": "Mlýn Davídkov, Praha",
    "rsvpDeadline": "Potvrďte prosím účast do 28. února 2026"
  },
  "countdown": {
    "title": "Odpočítávání do Velkého Dne",
    "days": "Dní",
    "hours": "Hodin",
    "minutes": "Minut",
    "seconds": "Sekund"
  },
  "story": {
    "title": "Náš Příběh",
    "content": "Bylo nebylo, v autobuse směřujícím do Evropského parlamentu ve Štrasburku se pohledný rumunský kluk setkal se sladkou českou dívkou. A začali se mít moc rádi, protože občas se dějí ÚŽAAAAAASNÉ věci...\n\nPřečtěte si celý příběh v galerii níže. Užijte si to! :)",
    "clickToView": "Klikněte a podívejte se na náš příběh",
    "slides": [
      "Příběh Nových Evropanů",
      "Bylo nebylo, v autobuse směřujícím do Evropského parlamentu ve Štrasburku se pohledný rumunský kluk setkal se sladkou českou dívkou. A začali se mít moc rádi, protože občas se dějí ÚŽAAAAAASNÉ věci...",
      "Nedlouho poté Štefan získal Kristýnino srdce, protože byl moc milý, laskavý, vtipný, chytrý a samozřejmě nádherný... Byl jako okouzlující princ z nějaké pohádky... Byl statečný a pomáhal lidem v nebezpečí nebo v nouzi.",
      "Velmi brzy se znovu setkali v baru Konrad a začala jejich krásná cesta...",
      "Nebylo to vždy snadné... Ale i když se občas hádali a někdy měli pocit, že si nerozumějí...",
      "... měli se moc rádi a vážili si jeden druhého... a opravdu rádi spolu trávili čas...",
      "Štefan brzy zjistil, že Kristýna není obyčejná holka",
      "A Kristýna zjistila, jak výjimečný Štefan je a jak je s ním šťastná...",
      "Poté byli na chvíli odděleni a zjistili, jak moc se navzájem potřebují...",
      "... a tak jednoho dne Štefan řekl: \"Opravdu bych s tebou chtěl žít.\". A Kristýna řekla: \"Já taky\"",
      "A od té doby spolu strávili spoustu ÚŽAAAAAASNÝCH chvil...",
      "První noc společně ve stanu - Karpaty 2017",
      "První společná dovolená - Asie 2018",
      "První letní tábor - Šteflovka 2019",
      "S jejich milovaným čtyřnohým členem rodiny, Maxem - Rumunsko 2020",
      "Roadtrip s Maxem - Slovinsko 2021",
      "Jedna otázka, jedna odpověď na věčnost - Lipno 2022",
      "Do jejich rodiny se připojil zázrak. Děkujeme, že sis nás vybrala, Oli! - Hořovice 2023",
      "První dovolená s Olivií - Skiathos 2024",
      "Nový typ pařeb: ve školce - Bukurešť 2025",
      "A žili šťastně až do smrti!"
    ]
  },
  "location": {
    "title": "Místo & Doprava",
    "venueName": "Mlýn Davídkov",
    "venueDescription": "Krásný historický mlýn zasazený do malebné české krajiny nedaleko Prahy. Toto kouzelné místo kombinuje rustikální šarm s elegantní sofistikovaností a poskytuje perfektní prostředí pro náš velký den.",
    "venueWebsite": "Navštivte webové stránky místa konání",
    "address": "Adresa",
    "addressDetails": "Hryzely 36, 281 63 Barchovice-Zásmuky, Česko",
    "openInMaps": "Otevřít v Google Mapách",
    "gettingThere": "Jak se tam dostat",
    "fromPrague": "Z Prahy",
    "fromPragueDetails": "Místo se nachází přibližně 20 km jihozápadně od centra Prahy. Veřejná doprava není k dispozici.",
    "fromAirport": "Z Letiště",
    "fromAirportDetails": "Letiště Václava Havla Praha (PRG) je nejbližší mezinárodní letiště, přibližně 30 km od místa konání. Cesta trvá přibližně 30-40 minut.",
    "transportation": "Doprava",
    "transportationDetails": "Pro ty, kteří přilétají a potřebují dopravu z letiště, budeme mít minivan, který pojede mezi letištěm a místem konání v pátek odpoledne a v sobotu ráno. Jen se ujistěte, že nám předem dáte vědět o svých plánech. Pro větší flexibilitu a možnost objevovat krásnou českou krajinu vlastním tempem doporučujeme pronájem auta na letišti.",
    "accommodation": "Ubytování",
    "accommodationDetails": "Poskytneme ubytování v sobotu večer na místě konání. Budeme tam od pátku, takže pokud se k nám chcete připojit i v pátek, dejte nám prosím vědět a můžeme pro vás zajistit ubytování. Parkování je k dispozici na místě konání pro všechny."
  },
  "rsvp": {
    "title": "Potvrdit Účast",
    "description": "Dejte nám prosím vědět do 28. února, zda se k nám můžete připojit v náš velký den",
    "name": "Celé Jméno",
    "email": "Email",
    "guests": "Počet Hostů",
    "guestNames": "Jména Všech Hostů",
    "guestNamesPlaceholder": "Uveďte prosím jména všech hostů, kteří se zúčastní (jedno na řádek)",
    "arrivalDay": "Obřad je v sobotu kolem 13:00. Plánujete dorazit na místo v pátek odpoledne nebo v sobotu ráno?",
    "friday": "V pátek odpoledne",
    "saturday": "V sobotu ráno",
    "attending": "Zúčastníte se?",
    "yes": "Ano, budu tam!",
    "no": "Bohužel se nemůžu zúčastnit",
    "dietary": "Máte nějaká potravinová omezení, alergie nebo preference (veganství, vegetariánství atd.)?",
    "dietaryPlaceholder": "Dejte nám vědět o jakýchkoli stravovacích potřebách",
    "songSuggestion": "Kterou píseň bychom měli určitě hrát na párty?",
    "songSuggestionPlaceholder": "Název písně nebo interpret",
    "message": "Vzkaz pro Nás",
    "messagePlaceholder": "Sdílejte s námi své myšlenky",
    "submit": "Odeslat Potvrzení",
    "success": "Děkujeme za potvrzení!",
    "error": "Vyplňte prosím všechna povinná pole"
  },
  "footer": {
    "seeYouThere": "Nemůžeme se dočkat, až to s Vámi oslavíme!",
    "date": "11. července 2026"
  }
}
