{
  "nav": {
    "ourStory": "Povestea Noastră",
    "location": "Locație & Călătorie",
    "rsvp": "Confirmă Prezența"
  },
  "home": {
    "names": "Răzvan & Kristýna",
    "title": "Răzvan & Kristýna",
    "subtitle": "\"Vom spune DA\"",
    "date": "11 iulie 2026",
    "countdown": "{days} zile, {hours} ore, {minutes} minute și {seconds} secunde până la ziua noastră specială!",
    "venue": "Mlýn Davídkov, Praga",
    "rsvpDeadline": "Vă rugăm să confirmați prezența până la 28 februarie 2026"
  },
  "countdown": {
    "title": "Numărătoare Inversă până în Ziua Mare",
    "days": "Zile",
    "hours": "Ore",
    "minutes": "minute",
    "seconds": "Secunde"
  },
  "story": {
    "title": "Povestea Noastră",
    "content": "A fost odată ca niciodată, într-un autobuz spre Parlamentul European din Strasbourg, un băiat român chipeș și o fată cehă drăguță. Și au început să le placă foarte mult unul de celălalt pentru că uneori se întâmplă lucruri UIMITOAAAAARE...\n\nCitiți povestea completă în galeria foto de mai jos. Distrați-vă! :)",
    "clickToView": "Apasă și descoperă povestea noastră",
    "slides": [
      "Povestea Noilor Europeni",
      "A fost odată ca niciodată, într-un autobuz spre Parlamentul European din Strasbourg, un băiat român chipeș și o fată cehă drăguță. Și au început să le placă foarte mult unul de celălalt pentru că uneori se întâmplă lucruri UIMITOAAAAARE...",
      "Foarte curând, Răzvan a cucerit inima Kristýnei pentru că era foarte drăguț, amabil, amuzant, și, desigur, deștept. Era ca un prinț fermecător dintr-un basm... Era curajos și ajuta oamenii în pericol sau în nevoie.",
      "Nu mult timp după aceea s-au întâlnit din nou în barul Konrad și frumoasa lor călătorie a început...",
      "Nu a fost întotdeauna ușor... Dar deși se certau din când în când și uneori simțeau că nu se înțeleg...",
      "... se plăceau și se apreciau atât de mult... și le plăcea cu adevărat să petreacă timp împreună...",
      "Răzvan a descoperit curând că Kristýna nu este o fată obișnuită",
      "Și Kristýna a descoperit cât de special este Răzvan și cât de fericită este cu el...",
      "Apoi, au fost separați și au descoperit cât de mult au nevoie unul de celălalt...",
      "... așa că, într-o zi, Răzvan a spus: \"Aș vrea cu adevărat să locuiesc cu tine.\". Și Kristýna a spus: \"Și eu\"",
      "Și au petrecut atât de multe momente UIMITOAAAAARE împreună...",
      "Prima noapte împreună într-un cort - Munții Carpați 2017",
      "Prima vacanță împreună - Asia 2018",
      "Prima tabără de vară împreună - Šteflovka 2019",
      "Cu dragul lor membru de familie cu patru labe, Max - România 2020",
      "Excursie cu mașina cu Max - Slovenia 2021",
      "O întrebare, un răspuns pentru o eternitate - Lipno 2022",
      "O minune s-a alăturat familiei lor. Mulțumim că ne-ai ales, Olivia! - Hořovice 2023",
      "Prima vacanță cu Olivia - Skiathos 2024",
      "Experimentând un nou tip de petrecere: la grădiniță - București 2025",
      "Și au trăit fericiți până la adânci bătrâneți!"
    ]
  },
  "location": {
    "title": "Locație & Călătorie",
    "venueName": "Mlýn Davídkov",
    "venueDescription": "O moară istorică frumoasă, situată în pitoreasca zonă rurală cehă, aproape de Praga. Acest loc fermecător combină farmecul rustic cu eleganța rafinată, oferind cadrul perfect pentru ziua noastră specială.",
    "venueWebsite": "Vizitează Website-ul Locației",
    "address": "Adresă",
    "addressDetails": "Hryzely 36, 281 63 Barchovice-Zásmuky, Cehia",
    "openInMaps": "Deschide în Google Maps",
    "gettingThere": "Cum Ajungi",
    "fromPrague": "Din Praga",
    "fromPragueDetails": "Locația se află la aproximativ 20 km sud-vest de centrul Pragăi. Nu există transport public disponibil.",
    "fromAirport": "De la Aeroport",
    "fromAirportDetails": "Aeroportul Václav Havel Praga (PRG) este cel mai apropiat aeroport internațional, la aproximativ 30 km de locație. Permiteți aproximativ 30-40 de minute pentru călătorie.",
    "transportation": "Transport",
    "transportationDetails": "Pentru cei care zboară și au nevoie de transport de la aeroport, vom avea un microbuz care va face curse între aeroport și locație vineri după-amiază și sâmbătă dimineața. Asigurați-vă că ne anunțați din timp despre planurile voastre. Pentru mai multă flexibilitate în a explora frumoasa natură cehă în ritmul vostru, vă recomandăm să închiriați o mașină de la aeroport.",
    "accommodation": "Cazare",
    "accommodationDetails": "Vom oferi cazare sâmbătă seara la locație. Vom fi acolo începând de vineri, așa că dacă doriți să vă alăturați nouă și vineri, vă rugăm să ne anunțați și vom aranja cazare pentru voi. Parcarea este disponibilă la locație pentru toată lumea."
  },
  "rsvp": {
    "title": "Confirmă Prezența",
    "description": "Vă rugăm să ne anunțați până la 28 februarie dacă puteți să vă alăturați nouă în ziua noastră specială",
    "name": "Nume Complet",
    "email": "Adresă Email",
    "guests": "Număr de Invitați",
    "guestNames": "Numele Tuturor Invitaților",
    "guestNamesPlaceholder": "Vă rugăm să listați numele tuturor invitaților care vin (câte unul pe linie)",
    "arrivalDay": "Ceremonia este sâmbătă în jurul orei 13:00. Plănuiești să ajungi la locație vineri după-amiază sau sâmbătă dimineața?",
    "friday": "Vineri după-amiază",
    "saturday": "Sâmbătă dimineața",
    "attending": "Vei participa?",
    "yes": "Da, voi fi acolo!",
    "no": "Din păcate, nu pot veni",
    "dietary": "Aveți restricții alimentare, alergii sau preferințe (vegan, vegetarian, etc)?",
    "dietaryPlaceholder": "Anunțați-ne despre orice nevoi dietetice",
    "songSuggestion": "Ce melodie ar trebui să cântăm cu siguranță la petrecere?",
    "songSuggestionPlaceholder": "Titlul melodiei sau artistul",
    "message": "Mesaj pentru Noi",
    "messagePlaceholder": "Împărtășește-ne gândurile tale",
    "submit": "Trimite Confirmarea",
    "success": "Mulțumim pentru confirmare!",
    "error": "Te rugăm să completezi toate câmpurile obligatorii"
  },
  "footer": {
    "seeYouThere": "Abia așteptăm să sărbătorim împreună cu voi!",
    "date": "11 iulie 2026"
  }
}
